Repository: kindrakevich-agency/drupal_weather
Catalog: openmeteo_widget/translations/*.po
Languages: uk

source: Open-Meteo Weather Widget Settings
uk: Налаштування Віджета Погоди Open-Meteo

source: API Settings
uk: Налаштування API

source: API Endpoint
uk: Кінцева точка API

source: Open-Meteo API endpoint. Leave empty to use default: https://api.open-meteo.com/v1/forecast
uk: Кінцева точка API Open-Meteo. Залиште порожнім для використання стандартного: https://api.open-meteo.com/v1/forecast

source: API Key
uk: Ключ API

source: API key (optional - Open-Meteo free tier does not require one)
uk: Ключ API (необов'язково - безкоштовний рівень Open-Meteo не вимагає його)

source: Caching Settings
uk: Налаштування Кешування

source: Enable caching
uk: Увімкнути кешування

source: Cache weather data for 3 hours to reduce API calls.
uk: Кешувати дані про погоду протягом 3 годин для зменшення викликів API.

source: Last cache update
uk: Останнє оновлення кешу

source: Last run: @time
uk: Останній запуск: @time

source: Never run
uk: Ніколи не запускався

source: Fetch weather now
uk: Отримати погоду зараз

source: Display Settings
uk: Налаштування Відображення

source: Use Tailwind CDN
uk: Використовувати Tailwind CDN

source: Load TailwindCSS from CDN for widget styling. Disable if your theme already includes Tailwind or you want to use custom styles.
uk: Завантажити TailwindCSS з CDN для стилізації віджета. Вимкніть, якщо ваша тема вже включає Tailwind або ви хочете використовувати власні стилі.

source: City Management
uk: Управління Містами

source: City Name
uk: Назва Міста

source: Latitude
uk: Широта

source: Longitude
uk: Довгота

source: Actions
uk: Дії

source: No cities configured.
uk: Міста не налаштовані.

source: Remove
uk: Видалити

source: Add New City
uk: Додати Нове Місто

source: Start typing to search for a city. Coordinates will be filled automatically.
uk: Почніть вводити для пошуку міста. Координати будуть заповнені автоматично.

source: Auto-filled from city selection
uk: Автоматично заповнено з вибору міста

source: Or manually enter coordinates if you prefer.
uk: Або введіть координати вручну, якщо бажаєте.

source: City removed successfully.
uk: Місто успішно видалено.

source: City added successfully.
uk: Місто успішно додано.

source: Fetched weather data for @count cities.
uk: Отримано дані про погоду для @count міст.

source: Select City
uk: Вибрати Місто

source: Humidity
uk: Вологість

source: Precipitation
uk: Опади

source: Wind
uk: Вітер

source: Unable to load weather data. Please try again later.
uk: Не вдається завантажити дані про погоду. Будь ласка, спробуйте пізніше.

source: Weather
uk: Погода

source: No cities configured. Please contact the site administrator.
uk: Міста не налаштовані. Будь ласка, зв'яжіться з адміністратором сайту.

source: No cities configured. Please configure cities in the <a href="@url">settings</a>.
uk: Міста не налаштовані. Будь ласка, налаштуйте міста в <a href="@url">налаштуваннях</a>.

source: Clear sky
uk: Ясне небо

source: Mainly clear
uk: Переважно ясно

source: Partly cloudy
uk: Мінлива хмарність

source: Overcast
uk: Похмуро

source: Foggy
uk: Туман

source: Drizzle
uk: Мряка

source: Freezing drizzle
uk: Крижана мряка

source: Rain
uk: Дощ

source: Freezing rain
uk: Крижаний дощ

source: Snow
uk: Сніг

source: Snow grains
uk: Снігова крупа

source: Rain showers
uk: Зливи

source: Snow showers
uk: Снігопад

source: Thunderstorm
uk: Гроза

source: Thunderstorm with hail
uk: Гроза з градом

source: Unknown
uk: Невідомо
